---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsComponentConnection.PeerElementId
source: html/b6454a01-0ce3-b32d-8c7b-7359644386b3.htm
---
# Autodesk.Revit.DB.Architecture.StairsComponentConnection.PeerElementId Property

The element Id of peer connected stairs component in the stairs connection.

## Syntax (C#)
```csharp
public ElementId PeerElementId { get; }
```